Revit 2027 API
CurveIntersectResult Properties
The CurveIntersectResult type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Result |  The classification of intersection or overlap between the two curves.
Top
See Also
Reference
CurveIntersectResult Class
Autodesk.Revit.DB Namespace